const DICT = {
	'en': {
		
	},
	'ru': {
		'GeneralSettings': "Настройки",
		'ServerChoise': "Сервера",
		'OtherTab': 'Другое',
		
		'ShowTeacherPreview': 'Предпросмотр ДЗ учителя',
		'ShowTeacherPreview.Desc': 'Расширение попробует показать содержание задания, выданное преподавателем',
		'DarkTheme': 'Темная тема',
		'DarkTheme.Desc': 'Расширение перепишет нес-ко стилей, создав темную тему. Функция ещё тестируется, пожалуйста напишите мне если возникли проблемы',
		'LoadingIndicatorFix': 'Фоновый загрузчик',
		'LoadingIndicatorFix.Desc': 'Индикатор загрузки потеряет хитбокс, вам не нужно будет ждать пока загрузиться страница чтобы перейти на другую',
		'AiLearning': 'Обучение ИИ 🙏',
		'AiLearning.Desc': 'Я хочу сделать авто-проверку ДЗ, но мне нужен большой датасет и соответственно, ваша помощь. Когда появятся данные, вы увидите просьбу: "Основываясь на этом описании домашней работы, поставьте оценку от 1 до 10". Всё это - один большой эксперимент, появление фишки не гарантируется',
		'DoSessionUpdate': 'Обновлять сессию',
		'DoSessionUpdate.Desc': 'Чтобы вас не выкидывало из аккаунта, можно каждые 20 минут обновлять сессию. Работает не у всех, если вы испытваете проблемы при работе на сайте - отключите.',
		'FullScreenHomeworkCard': 'Большие карточки ДЗ',
		'FullScreenHomeworkCard.Desc': 'Карточка с домашним заданием будет занимать всю высоту допустимого окна. Только в полноэкранном режиме',
		'ImproveSiteStyle': 'Куча мелких исправлений',
		'ImproveSiteStyle.Desc': 'Опция исправит всякие мелкие CSS недостатки. Если что-то работает не так как работало - отключите опцию',
		'AiSettings': 'Поведение ИИ',
		'LoyalAI': 'Повышенная лояльность',
		'LoyalAI.Desc': 'Просить ИИ быть мягким и отвечать в более легкой форме. Применяется и к отзывам и к автопроверке дз',
		
		'CacheControl': 'Контроль кэша',
		'MemoryControl': 'Кэш',
		'MB': 'МБ',
		'MegaBytes_Took': 'мб. занято',
		'MaxCacheSize': 'Максимальный размер кэша',
		'ResetOldCache': 'Почистить неактуальный кэш',
		'ResetAllCache': 'Почистить весь кэш',
		'ResetAllCacheConfirm': 'Удалить весь кэш? Это повлияет на скорость открытия нек-ых дз',
		'recommended': 'Рекомендуется',
		
		'delete': `Удалить`,
		'ProjectOnGitHub': `Проект на GitHub`,
		
		'roulette.type.functions': 'Функции',
		'roulette.type.theme': 'Оформление',
		'roulette.type.other': 'Другое',
		
		'SettingsWasReloaded': 'Параметры применены!',
		'AboutProject': 'О проекте',
		'Done': 'Готово',
		'DoneAndCleared': 'Готово! Объектов удалено: ',
		'DoneAndNotCleared': 'Нечего очищать :(',
		'AboutThisProject_P1': `Этот проект был создан НЕ преподавателем, а учеником, по просьбе преподавателя. Я не могу обеспечивать полноценное тестирование кода в условиях работы от чужого лица.`,
		'AboutThisProject_P2': `Если вы видите что в расширении что-то не работает вы можете написать мне в Telegram, но в нек-ых случаях для исправления ошибки мне потребуются авторизационные данные. Либо, если вы обладаете навыками Web разработки, приветствуются Pull Request в GitHub репозиторий :)`,
		'ContactDev': 'Написать разработчику'
	},
	"ru-RU": "ru"
}



const lang = navigator.language;
const LoadLanguage =
    TranslateAssistant.isLangIncluded(DICT, lang) ? lang : 'en';
	
TranslateAssistant.init(LoadLanguage, DICT);
