const DICT = {
	'en': {
		
	},
	'ru': {
		'GeneralSettings': "Настройки",
		'ServerChoise': "Сервера",
		'OtherTab': 'Другое',
		
		'ShowTeacherPreview': 'Предпросмотр ДЗ учителя',
		'ShowTeacherPreview.Desc': 'Расширение попробует показать содержание задания, выданное преподавателем',
		'DarkTheme': 'Темная тема',
		'DarkTheme.Desc': 'Расширение перепишет нес-ко стилей, создав темную тему. Функция ещё тестируется, пожалуйста напишите мне если возникли проблемы',
		'LoadingIndicatorFix': 'Фоновый загрузчик',
		'LoadingIndicatorFix.Desc': 'Индикатор загрузки потеряет хитбокс, вам не нужно будет ждать пока загрузиться страница чтобы перейти на другую',
		'AiLearning': 'Обучение ИИ 🙏',
		'AiLearning.Desc': 'Помогите мне обучить классификатор. Оценивайте описание выполненной работы ученика, и в будущем, возможно появится автоматическая проверка дз. Это один большой эксперимент, появление функции не гарантируется',
		'DoSessionUpdate': 'Обновлять сессию',
		'DoSessionUpdate.Desc': 'Чтобы вас не выкидывало из аккаунта, можно каждые 20 минут обновлять сессию. Работает не у всех, если вы испытваете проблемы при работе на сайте - отключите.',
		'FullScreenHomeworkCard': 'Большие карточки ДЗ',
		'FullScreenHomeworkCard.Desc': 'Карточка с домашним заданием будет занимать всю высоту допустимого окна. Только в полноэкранном режиме',
		'CacheControl': 'Контроль кэша',
		'MemoryControl': 'Кэш',
		'MegaBytes_Took': 'мб. занято',
		
		'delete': `Удалить`,
		'ProjectOnGitHub': `Проект на GitHub`,
		
		'roulette.type.functions': 'Функции',
		'roulette.type.theme': 'Оформление',
		'roulette.type.other': 'Другое',
		
		'SettingsWasReloaded': 'Параметры применены!',
		'AboutProject': 'О проекте',
		'AboutThisProject': `
Этот проект был создан НЕ преподавателем, а учеником, по просьбе преподавателя. Я не могу обеспечивать полноценное тестирование кода в условиях работы от чужого лица.
Если вы видите что в расширении что-то не работает вы можете написать мне в Telegram, но для исправления ошибки мне потребуются ваши авторизационные данные. Либо, если вы обладаете навыками Web разработки, Pull Request в GitHub репозиторий приветствуется :)
Проект полностью спонсируется мной, включая: домен, VPS сервер и OpenAI API.
		`,
		'ContactDev': 'Написать разработчику'
	},
	"ru-RU": "ru"
}



const lang = navigator.language;
const LoadLanguage =
    TranslateAssistant.isLangIncluded(DICT, lang) ? lang : 'en';
	
TranslateAssistant.init(LoadLanguage, DICT);
